diegolorenzo12/RP2040_Rosserial/libs/rosserial/control_msgs/FollowJointTrajectoryActionGoal.h
#ifndef _ROS_control_msgs_FollowJointTrajectoryActionGoal_h
#define _ROS_control_msgs_FollowJointTrajectoryActionGoal_h

#include <stdint.h>
#include <string.h>
#include <stdlib.h>
#include "ros/msg.h"
#include "RP2040Includes.h"
#include "std_msgs/Header.h"
#include "actionlib_msgs/GoalID.h"
#include "control_msgs/FollowJointTrajectoryGoal.h"

namespace control_msgs
{

  class FollowJointTrajectoryActionGoal : public ros::Msg
  {
    public:
      typedef std_msgs::Header _header_type;
      _header_type header;
      typedef actionlib_msgs::GoalID _goal_id_type;
      _goal_id_type goal_id;
      typedef control_msgs::FollowJointTrajectoryGoal _goal_type;
      _goal_type goal;

    FollowJointTrajectoryActionGoal():
      header(),
      goal_id(),
      goal()
    {
    }

    virtual int serialize(unsigned char *outbuffer) const
    {
      int offset = 0;
      offset += this->header.serialize(outbuffer + offset);
      offset += this->goal_id.serialize(outbuffer + offset);
      offset += this->goal.serialize(outbuffer + offset);
      return offset;
    }

    virtual int deserialize(unsigned char *inbuffer)
    {
      int offset = 0;
      offset += this->header.deserialize(inbuffer + offset);
      offset += this->goal_id.deserialize(inbuffer + offset);
      offset += this->goal.deserialize(inbuffer + offset);
     return offset;
    }

    #ifdef ESP8266
        const char * getType() { return  ("control_msgs/FollowJointTrajectoryActionGoal");};
    #else
        const char * getType() { return  PSTR("control_msgs/FollowJointTrajectoryActionGoal");};
    #endif
    #ifdef ESP8266
        const char * getMD5() { return  ("cff5c1d533bf2f82dd0138d57f4304bb");};
    #else
        const char * getMD5() { return  PSTR("cff5c1d533bf2f82dd0138d57f4304bb");};
    #endif

  };

}
#endif
